src/cf/InformationRegisters/эв_ОчередьЗапросовСпасибо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ОчередьЗапросовСпасибо</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>end_point</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>service</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>body</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>http_status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>send_limit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>metod</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/эв_ТипыСообщенийЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>эв_ТипыСообщенийЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервисное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СпособыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СпособыОплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетЭквайринг</Name>
					<Comment>Банковский счет для эквайринговых операций</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Патент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныеНастройкиНалоговогоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДляКредита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДляОплатыСБП</Name>
					<Comment>Служебный реквизит, необходим для разделения эквайринговых теминалов на способы оплаты платежных систем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпособовОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыПлатежныхКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число7_4</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриОтмене</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число7_4</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриВозврате</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число7_4</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяСистема</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПлатежнойСистемыККТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/эвПараметрыЭквайринкогоТерминалаСпасибо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>эвПараметрыЭквайринкогоТерминалаСпасибо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СпособыОплаты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>networks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>partners</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>servicePointExtId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроцессинга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>P_DistribPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйПроцентОплатыБонусами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаФиктивнаяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/эвСберСпасибоСервер/Ext/Module.bsl
Функция эв_СоединитьсяСПроцессингом(Выборка) Экспорт
	
	ssl = Неопределено;
	
	Если ТипЗнч(Выборка) = Тип("Структура") И Выборка.Свойство("АдресПроцессинга") Тогда
		
		ПараметрыТерминала = Выборка;
		end_point          = Выборка.АдресПроцессинга; 
		
	Иначе // Выборка из очереди
		
		ПараметрыТерминала = эвСберСпасибоСерверКеш.ПолучитьПараметрыТерминалаСпасибо(Выборка.Терминал); 
		end_point = Выборка.end_point; 
		
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("pfx");

	//ДД = ПараметрыТерминала.АдресСертификата.Получить();

	Если ЭтоАдресВременногоХранилища(ПараметрыТерминала.АдресСертификата) Тогда
		ДД = ПолучитьИзВременногоХранилища(ПараметрыТерминала.АдресСертификата);
		Попытка
			ДД.Записать(ИмяФайла);
		Исключение
			
			ЗаписатьЛогСпасибо(
				НСтр("ru = 'Ошибка получения сертификата из двоичных данных'")
					+ Символы.ПС
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				Истина);
			
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	СертификатКлиентаWindows = Новый СертификатКлиентаФайл(ИмяФайла, ПараметрыТерминала.ПарольСертификата);
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWindows, Неопределено);
	
	Попытка
		
		Соединение = Новый HTTPСоединение(end_point,,,,,,ssl);
		
	Исключение
		
		Соединение = Неопределено;
		
		ЗаписатьЛогСпасибо(
			НСтр("ru = 'Ошибка соединения с сервером Спасибо'")
				+ Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			Истина);
		
	КонецПопытки;

    Возврат Соединение;
	
КонецФункции // ()

		 
		 
Процедура СохранитьЗапросВОчереди(ПараметрыОчереди) Экспорт
	
	ТелоЗапроса = "";
	Заголовки   = ""; 
	 
	Если ПараметрыОчереди.Свойство("body") И ЗначениеЗаполнено(ПараметрыОчереди.body) Тогда
		ТелоЗапроса = ЗначениеВСтрокуВнутр(ПараметрыОчереди.body);  
		ТелоЗапроса = СтрЗаменить(ТелоЗапроса,"¶","")
	КонецЕсли; 
	
	Если ПараметрыОчереди.Свойство("Заголовки") И ЗначениеЗаполнено(ПараметрыОчереди.Заголовки) Тогда 
		Заголовки = ЗначениеВСтрокуВнутр(ПараметрыОчереди.Заголовки);
		Заголовки = СтрЗаменить(Заголовки,"¶","")
	КонецЕсли;
	
	
	МЗ = РегистрыСведений.эв_ОчередьЗапросовСпасибо.СоздатьМенеджерЗаписи();
	МЗ.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыОчереди);        
	МЗ.body          = ТелоЗапроса;
	МЗ.Заголовки     = Заголовки;  
	МЗ.ДатаЗапроса   = ТекущаяДатаСеанса();
	МЗ.Записать();

КонецПроцедуры  

Процедура эвОчередьЗапросов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	эвОчередьЗапросов.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	эвОчередьЗапросов.end_point КАК end_point,
		|	эвОчередьЗапросов.service КАК service,
		|	эвОчередьЗапросов.body КАК body,
		|	эвОчередьЗапросов.http_status КАК http_status,
		|	эвОчередьЗапросов.send_limit КАК send_limit,
		|	эвОчередьЗапросов.Терминал КАК Терминал,
		|	эвОчередьЗапросов.metod КАК metod
		|ИЗ
		|	РегистрСведений.эв_ОчередьЗапросовСпасибо КАК эвОчередьЗапросов
		|ГДЕ
		|	эвОчередьЗапросов.http_status ПОДОБНО &http_status";
	
	Запрос.УстановитьПараметр("http_status","400"); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.эв_ОчередьЗапросовСпасибо.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);

		Если Выборка.send_limit <= 20 Тогда
		
			Ответ = ОбработатьЭлементОчереди(Выборка);       
		
			МЗ.http_status = Ответ.http_status;
			МЗ.ТекстОшибки = Ответ.ТекстОшибки;

		Иначе
			
			МЗ.http_status = "404";
			МЗ.ТекстОшибки = "Исчерпано более 20 попыток обработки запроса";
			
		КонецЕсли;

		МЗ.ДатаЗапроса = ТекущаяДатаСеанса();
		МЗ.send_limit  = МЗ.send_limit + 1;
		МЗ.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьЭлементОчереди(Выборка) Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("Результат",   Ложь);
	Ответ.Вставить("http_status", "400");
	Ответ.Вставить("ТекстОшибки", "");
	
	ТелоЗапроса = "";
	Если ЗначениеЗаполнено(Выборка.body) Тогда
		ТелоЗапроса = ЗначениеИзСтрокиВнутр(Выборка.body); 
		Если НЕ ТипЗнч(ТелоЗапроса) = Тип("Структура") Тогда
			ТелоЗапроса = "";
		КонецЕсли;
	КонецЕсли;

	HTTPОтвет = ОтправитьHTTPзапрос(Выборка, Выборка.service, ТелоЗапроса, Выборка.metod);
	
	Если (HTTPОтвет.КодСостояния = 201 ИЛИ HTTPОтвет.КодСостояния = 200) Тогда
		Ответ.Результат   = Истина;
		Ответ.http_status = HTTPОтвет.КодСостояния;
	Иначе      
		
		Ответ.ТекстОшибки = Строка(HTTPОтвет.КодСостояния);
		
		Если HTTPОтвет.Свойство("message") Тогда
			Ответ.ТекстОшибки = Ответ.ТекстОшибки + " " + HTTPОтвет.message;
		КонецЕсли; 
		
		Если HTTPОтвет.Свойство("error") Тогда
			Ответ.ТекстОшибки = Ответ.ТекстОшибки + " " + HTTPОтвет.error;
		КонецЕсли; 
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции // ОбработатьЭлементОчереди()

Функция ОтправитьHTTPзапрос(ПараметрыБонусовСпасибо, Ресурс, Данные = Неопределено, Метод = "POST") Экспорт
	

    Соединение = эв_СоединитьсяСПроцессингом(ПараметрыБонусовСпасибо);
	
	Если Соединение = Неопределено Тогда
		Возврат Новый Структура("КодСостояния",400);  
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
    Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	HTTPЗапрос  = Новый HTTPЗапрос(Ресурс, Заголовки);

	Если НЕ Данные = Неопределено Тогда
	
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, Данные);			
		ТелоЗапроса = ЗаписьJSON.Закрыть(); 
		
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
		
	КонецЕсли;
	
	Лог = ПолучитьИмяВременногоФайла("txt");
	
	ТекстОшибки = "";
	
	Если Метод = "POST" Тогда
		
		Попытка
			
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			
		Исключение  
			
			Возврат Новый Структура("error,КодСостояния", "Ошибка отправки POST-запроса к серверу Спасибо", 404);

		КонецПопытки;
		
	ИначеЕсли Метод = "PUT" Тогда

		Попытка

			Ответ = Соединение.ВызватьHTTPМетод("PUT",HTTPЗапрос);
			
		Исключение    
			
			Возврат Новый Структура("error,КодСостояния", "Ошибка отправки PUT-запроса к серверу Спасибо", 404);
			
		КонецПопытки;

	Иначе
		Возврат Новый Структура("КодСостояния,error", 400, "Не известный метод");
	КонецЕсли;
	
	ТекстСообщения = "";
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ТекстСообщения = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON, Ложь);
		СтруктураОтвета.Вставить("КодСостояния", Ответ.КодСостояния);
	Исключение
		СтруктураОтвета = Новый Структура("error,КодСостояния", "Ошибка разбора ответа сервера процессинга", Ответ.КодСостояния);
	КонецПопытки;

	ТекДанные = "====================== Операция: " + Метод + " " + HTTPЗапрос.АдресРесурса + " ======================" + Символы.ПС;
	ТекДанные = ТекДанные + "Точное время начала выполнения операции: "+XMLСтрока(ТекущаяДата())+Символы.ПС+Символы.ПС; 
	ТекДанные = ТекДанные + "Метод: "   + Метод + " " + HTTPЗапрос.АдресРесурса + Символы.ПС + Символы.ПС;  
	ТекДанные = ТекДанные + "Запрос: "  + Символы.ПС;  
	ТекДанные = ТекДанные + СтрЗаменить(ТелоЗапроса,Символы.ПС,"") + Символы.ПС + Символы.ПС;  
	ТекДанные = ТекДанные + "Ответ: "   + Символы.ПС;  
	ТекДанные = ТекДанные + ТекстСообщения + Символы.ПС + Символы.ПС; 
	Если ТекстОшибки = "" Тогда
		ТекДанные = ТекДанные + "Комментарий: успешно";  
	Иначе
		ТекДанные = ТекДанные + "Комментарий: не успешно" + Символы.ПС;  
		ТекДанные = ТекДанные + ТекстОшибки + Символы.ПС + ТекстСообщения;	
	КонецЕсли;
	
	ЗаписатьЛогСпасибо(ТекДанные, ТекстОшибки <> "");
	
	Возврат СтруктураОтвета;

КонецФункции

Процедура эв_ДобавитьРеквизитыСпасибо(Форма) Экспорт
    
    ДобавляемыеРеквизиты = Новый Массив;

    Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "эвНеВходитВАссортиментСберСпасибо") Тогда
   	 
        ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
        	"эвНеВходитВАссортиментСберСпасибо",
        	Новый ОписаниеТипов("Булево"),
        	"Объект.Товары",
        	НСтр("ru = 'Не входит в ассортимент СберСпасибо'"))); 
        
    КонецЕсли;

    Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "МаксСуммаОплатыСпасибо") Тогда
        
        ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
            "МаксСуммаОплатыСпасибо",
            Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),
            ,
            "Спасибо"));
        
    КонецЕсли;
    
    Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "МаксимальныйПроцентОплатыБонусами") Тогда
        
        ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
            "МаксимальныйПроцентОплатыБонусами",
            Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2)),
            ,
            "Макс. процент оплаты бонусами"));
        
    КонецЕсли;
    
    Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
        Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
    КонецЕсли;
    
    Если Форма.Элементы.Найти("ГруппаМаксСуммаОплатыСпасибо") = Неопределено Тогда
   	 
   	 РодительскаяГруппа = Форма.Элементы.Найти("ГруппаСуммаИтогоПоЧеку");
   	 Если НЕ РодительскаяГруппа = Неопределено Тогда
   		 
   		 РодительскаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
   		 
   		 ГруппаСпасибо = Форма.Элементы.Добавить("ГруппаМаксСуммаОплатыСпасибо", Тип("ГруппаФормы"), РодительскаяГруппа);
   		 ГруппаСпасибо.Вид = ВидГруппыФормы.ОбычнаяГруппа;
   		 ГруппаСпасибо.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
   		 ГруппаСпасибо.ОтображатьЗаголовок = Ложь;
   		 ГруппаСпасибо.Отображение = ОтображениеОбычнойГруппы.Нет;
   		 ГруппаСпасибо.РастягиватьПоГоризонтали = Истина;
   		 ГруппаСпасибо.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
   		 
   		 ГруппаСуммаСпасибо = Форма.Элементы.Добавить("ГруппаМаксСуммаОплатыСпасибоДанные", Тип("ГруппаФормы"), ГруппаСпасибо);
   		 ГруппаСуммаСпасибо.Вид = ВидГруппыФормы.ОбычнаяГруппа;
   		 ГруппаСуммаСпасибо.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
   		 ГруппаСуммаСпасибо.ОтображатьЗаголовок = Ложь;
   		 ГруппаСуммаСпасибо.Отображение = ОтображениеОбычнойГруппы.Нет;
   		 ГруппаСуммаСпасибо.РастягиватьПоГоризонтали = Истина;
   		 
   		 ИндикаторСпасибо = Форма.Элементы.Добавить("НадписьДоступнаОплатаБонусамиСпасибо", Тип("ДекорацияФормы"), ГруппаСуммаСпасибо);
   		 ИндикаторСпасибо.Вид = ВидДекорацииФормы.Картинка;
   		 ИндикаторСпасибо.Картинка = БиблиотекаКартинок.ЗеленыйШар;
   		 ИндикаторСпасибо.РазмерКартинки = РазмерКартинки.Пропорционально;
   		 ИндикаторСпасибо.Высота = 1;
   		 ИндикаторСпасибо.Ширина = 2;
   		 ИндикаторСпасибо.РастягиватьПоГоризонтали = Ложь;
   		 ИндикаторСпасибо.РастягиватьПоВертикали = Ложь;
   		 ИндикаторСпасибо.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
   		 ИндикаторСпасибо.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
   		 ИндикаторСпасибо.Подсказка = НСтр("ru = 'Доступна оплата бонусами'");
   		 
   		 ЛоготипСпасибо = Форма.Элементы.Добавить("МаксСуммаОплатыСпасибоЛоготип", Тип("ДекорацияФормы"), ГруппаСуммаСпасибо);
   		 ЛоготипСпасибо.Вид = ВидДекорацииФормы.Картинка;
   		 ЛоготипСпасибо.Картинка = БиблиотекаКартинок.РМКЛоготипСберСпасибо;
   		 ЛоготипСпасибо.РазмерКартинки = РазмерКартинки.Пропорционально;
   		 ЛоготипСпасибо.Высота = 1;
   		 ЛоготипСпасибо.Ширина = 8;
   		 ЛоготипСпасибо.РастягиватьПоГоризонтали = Ложь;
   		 ЛоготипСпасибо.РастягиватьПоВертикали = Ложь;
   		 ЛоготипСпасибо.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
   		 ЛоготипСпасибо.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
   		 
   		 ГруппаДоИСумма = Форма.Элементы.Добавить("ГруппаДоМаксСуммаОплатыСпасибо", Тип("ГруппаФормы"), ГруппаСуммаСпасибо);
   		 ГруппаДоИСумма.Вид = ВидГруппыФормы.ОбычнаяГруппа;
   		 ГруппаДоИСумма.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
   		 ГруппаДоИСумма.ОтображатьЗаголовок = Ложь;
   		 ГруппаДоИСумма.Отображение = ОтображениеОбычнойГруппы.Нет;
   		 ГруппаДоИСумма.РастягиватьПоГоризонтали = Истина;
   		 ГруппаДоИСумма.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
  		 
   		 ПолеСпасибо = Форма.Элементы.Добавить("МаксСуммаОплатыСпасибо", Тип("ПолеФормы"), ГруппаДоИСумма);
   		 ПолеСпасибо.Заголовок = НСтр("ru = 'до'");
   		 ПолеСпасибо.Вид = ВидПоляФормы.ПолеНадписи;
   		 ПолеСпасибо.ПутьКДанным = "МаксСуммаОплатыСпасибо";
   		 ПолеСпасибо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
   		 ПолеСпасибо.ЦветТекста = WebЦвета.Зеленый;
   		 ПолеСпасибо.Шрифт = ШрифтыСтиля.ШрифтОбычныйПолужирный18РМК;
   		 ПолеСпасибо.ЦветТекстаЗаголовка = WebЦвета.Зеленый;
   		 ПолеСпасибо.ШрифтЗаголовка = ШрифтыСтиля.ШрифтОбычныйПолужирный14РМК;    
   		 ПолеСпасибо.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
   		 ПолеСпасибо.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
   		 ПолеСпасибо.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
   		 ПолеСпасибо.Высота = 1;
   		 ПолеСпасибо.Ширина = 10;
   		 ПолеСпасибо.АвтоМаксимальнаяШирина = Ложь;
   		 ПолеСпасибо.РастягиватьПоГоризонтали = Ложь;
   		 ПолеСпасибо.Формат = "ЧДЦ=2; ЧН=0,00";
   		 ПолеСпасибо.ТолькоПросмотр = Истина;
   		 ПолеСпасибо.ПропускатьПриВводе = Истина;
   		 ПолеСпасибо.Гиперссылка = Ложь;
   		 
   	 КонецЕсли;
    КонецЕсли;

    ИмяЭлемента = "эвНадписьRRN";
    Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
   	 
   	 РодительскаяГруппа = Форма.Элементы.Найти("ГруппаОбщиеИтоги");
   	 Если НЕ РодительскаяГруппа = Неопределено Тогда
   		 
   		 ЭлементПеред = Форма.Элементы.Найти("ОтменитьВсеОплаты");
   		 НадписьRRN = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"), РодительскаяГруппа, ЭлементПеред);
   		 НадписьRRN.Вид = ВидДекорацииФормы.Надпись;
   		 НадписьRRN.Заголовок = "";
   		 НадписьRRN.Видимость = Ложь;
   		 НадписьRRN.АвтоМаксимальнаяШирина = Ложь;
   		 НадписьRRN.РастягиватьПоГоризонтали = Истина;
   		 НадписьRRN.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
   		 НадписьRRN.Шрифт = ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК;
   		 
   	 КонецЕсли;
    КонецЕсли;
    
    Если Форма.Элементы.Найти("ТоварыэвНеВходитВАссортиментСберСпасибо") = Неопределено Тогда
   	 ТаблицаТовары = Форма.Элементы.Найти("Товары");
   	 Если НЕ ТаблицаТовары = Неопределено Тогда
   		 ПолеПризнака = Форма.Элементы.Добавить("ТоварыэвНеВходитВАссортиментСберСпасибо", Тип("ПолеФормы"), ТаблицаТовары);
   		 ПолеПризнака.Вид = ВидПоляФормы.ПолеФлажка;
   		 ПолеПризнака.ПутьКДанным = "Объект.Товары.эвНеВходитВАссортиментСберСпасибо";
   		 ПолеПризнака.Видимость = Ложь;
   		 ПолеПризнака.ТолькоПросмотр = Истина;
   		 ПолеПризнака.ПропускатьПриВводе = Истина;
   	 КонецЕсли;
    КонецЕсли;

КонецПроцедуры

Функция эв_РассчитатьМаксСуммаОплатыСпасибоНаСервере(Товары, МаксПроцентОплатыБонусами) Экспорт
	
	Если МаксПроцентОплатыБонусами = 0 Тогда
	    Возврат 0;
	КонецЕсли;    
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.СуммаБезСкидки КАК СуммаБезСкидки
	|ПОМЕСТИТЬ ТаблицаВЗапросе
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ТаблицаВЗапросе.СуммаБезСкидки * &МаксПроцентОплатыБонусами / 100), 0) КАК Сумма
	|ИЗ
	|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
	|ГДЕ
	|	НЕ ТаблицаВЗапросе.Номенклатура.эвНеВходитВАссортиментСберСпасибо";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("МаксПроцентОплатыБонусами", МаксПроцентОплатыБонусами);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Окр(Выборка.Сумма, 0);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция эв_ПолучитьМаксПроцентОплатыБонусамиНаСервере(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпособыОплаты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Терминалы
	|ИЗ
	|	Справочник.СпособыОплаты КАК СпособыОплаты
	|ГДЕ
	|	(ВЫРАЗИТЬ(СпособыОплаты.Касса КАК Справочник.КассыККМ)) = &КассаККМ
	|	И НЕ СпособыОплаты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(эвПараметрыЭквайринкогоТерминалаСпасибо.МаксимальныйПроцентОплатыБонусами) КАК МаксимальныйПроцентОплатыБонусами
	|ИЗ
	|	Справочник.эвПараметрыЭквайринкогоТерминалаСпасибо КАК эвПараметрыЭквайринкогоТерминалаСпасибо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Терминалы КАК ВТ_Терминалы
	|		ПО эвПараметрыЭквайринкогоТерминалаСпасибо.Владелец = ВТ_Терминалы.Ссылка
	|ГДЕ
	|	НЕ эвПараметрыЭквайринкогоТерминалаСпасибо.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Окр(Выборка.МаксимальныйПроцентОплатыБонусами, 0);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция эв_ПолучитьПараметрыТерминалаСпасибоСервер(Терминал) Экспорт
	
	Пар = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.networks КАК networks,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.partners КАК partners,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.НомерТерминала КАК НомерТерминала,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.servicePointExtId КАК servicePointExtId,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.Сертификат КАК Сертификат,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.ПарольСертификата КАК ПарольСертификата,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.АдресПроцессинга КАК АдресПроцессинга,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.P_DistribPath КАК P_DistribPath,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.ОднаФиктивнаяПозиция КАК ОднаФиктивнаяПозиция,
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.МаксимальныйПроцентОплатыБонусами КАК МаксимальныйПроцентОплатыБонусами
		|ИЗ
		|	Справочник.эвПараметрыЭквайринкогоТерминалаСпасибо КАК эвПараметрыЭквайринкогоТерминалаСпасибо
		|ГДЕ
		|	эвПараметрыЭквайринкогоТерминалаСпасибо.ПометкаУдаления = ЛОЖЬ
		|	И эвПараметрыЭквайринкогоТерминалаСпасибо.Владелец = &Терминал";
	
	Запрос.УстановитьПараметр("Терминал", Терминал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Пар.Вставить("АдресПроцессинга",  ВыборкаДетальныеЗаписи.АдресПроцессинга);
		Пар.Вставить("networks",          ВыборкаДетальныеЗаписи.networks);
		Пар.Вставить("partners",          ВыборкаДетальныеЗаписи.partners);
		Пар.Вставить("НомерТерминала",    ВыборкаДетальныеЗаписи.НомерТерминала);
		Пар.Вставить("servicePointExtId", ВыборкаДетальныеЗаписи.servicePointExtId);
		Пар.Вставить("ПарольСертификата", ВыборкаДетальныеЗаписи.ПарольСертификата); 
		Пар.Вставить("P_DistribPath",     ВыборкаДетальныеЗаписи.P_DistribPath); 
		Пар.Вставить("ОднаФиктивнаяПозиция", ВыборкаДетальныеЗаписи.ОднаФиктивнаяПозиция); 
		Пар.Вставить("МаксимальныйПроцентОплатыБонусами", ВыборкаДетальныеЗаписи.МаксимальныйПроцентОплатыБонусами); 
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Сертификат) = Тип("ХранилищеЗначения") Тогда
			ХЗ = ВыборкаДетальныеЗаписи.Сертификат.Получить();
			Если ХЗ = Неопределено Тогда
				Пар.Вставить("АдресСертификата", Неопределено);
			Иначе
				Пар.Вставить("АдресСертификата",  ПоместитьВоВременноеХранилище(ХЗ, Новый УникальныйИдентификатор));
			КонецЕсли; 
		Иначе
			Пар.Вставить("АдресСертификата", Неопределено);
		КонецЕсли;
		
	Иначе	
		Пар = Неопределено;
	КонецЕсли;
	
    Возврат Пар;
	
КонецФункции // ПолучитьПараметрыТерминалаСпасибо()

Функция эв_ПолучитьПараметрыПроверкиДоступаКПроцессингуПоКассеККМ(КассаККМ, УникальныйИдентификаторФормы) Экспорт
    
    Если Не ЗначениеЗаполнено(КассаККМ) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   СпособыОплаты.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ ВТ_Терминалы
    |ИЗ
    |   Справочник.СпособыОплаты КАК СпособыОплаты
    |ГДЕ
    |   (ВЫРАЗИТЬ(СпособыОплаты.Касса КАК Справочник.КассыККМ)) = &КассаККМ
    |   И НЕ СпособыОплаты.ПометкаУдаления
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   эвПараметрыЭквайринкогоТерминалаСпасибо.АдресПроцессинга КАК АдресПроцессинга,
    |   эвПараметрыЭквайринкогоТерминалаСпасибо.ПарольСертификата КАК ПарольСертификата,
    |   эвПараметрыЭквайринкогоТерминалаСпасибо.Сертификат КАК Сертификат,
    |   эвПараметрыЭквайринкогоТерминалаСпасибо.networks КАК networks,
    |   эвПараметрыЭквайринкогоТерминалаСпасибо.partners КАК partners
    |ИЗ
    |   Справочник.эвПараметрыЭквайринкогоТерминалаСпасибо КАК эвПараметрыЭквайринкогоТерминалаСпасибо
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Терминалы КАК ВТ_Терминалы
    |       ПО эвПараметрыЭквайринкогоТерминалаСпасибо.Владелец = ВТ_Терминалы.Ссылка
    |ГДЕ
    |   НЕ эвПараметрыЭквайринкогоТерминалаСпасибо.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Если Не Выборка.Следующий() Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    ПараметрыПроверки = Новый Структура;
    ПараметрыПроверки.Вставить("АдресПроцессинга", Выборка.АдресПроцессинга);
    ПараметрыПроверки.Вставить("ПарольСертификата", Выборка.ПарольСертификата);
    ПараметрыПроверки.Вставить("networks", Выборка.networks);
    ПараметрыПроверки.Вставить("partners", Выборка.partners);
    
    АдресСертификата = Неопределено;
    Если ТипЗнч(Выборка.Сертификат) = Тип("ХранилищеЗначения") Тогда
        ДанныеСертификата = Выборка.Сертификат.Получить();
        Если ДанныеСертификата <> Неопределено Тогда
            АдресСертификата = ПоместитьВоВременноеХранилище(ДанныеСертификата, УникальныйИдентификаторФормы);
        КонецЕсли;
    КонецЕсли;
    ПараметрыПроверки.Вставить("АдресСертификата", АдресСертификата);
    
    Возврат ПараметрыПроверки;
    
КонецФункции


// Добавляет сообщение в пакет и запускает запись в Эв_ЛогСпасибо фоновым заданием.
// С клиента передаётся готовый МассивЛогов (цикл обмена); с сервера — один элемент.
// Элемент: ДатаОперации, Идентификатор, ЭтоОшибка, Сообщение.
// Регистр: измерения ДатаОперации, Идентификатор, Тип; ресурс Сообщение.
//
Процедура ЗаписатьЛогСпасибо(ТекстСообщения, ЭтоОшибка = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементЛога = Новый Структура;
	ЭлементЛога.Вставить("ДатаОперации", ТекущаяДатаСеанса());
	ЭлементЛога.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	ЭлементЛога.Вставить("ЭтоОшибка", ЭтоОшибка);
	ЭлементЛога.Вставить("Сообщение", ТекстСообщения);
	
	МассивЛогов = Новый Массив;
	МассивЛогов.Добавить(ЭлементЛога);
	
	ЗапуститьЗаписьЛоговСпасибоВФоне(МассивЛогов);
	
КонецПроцедуры

// Запускает фоновую запись пакета логов. Вызывается с клиента после цикла обмена.
//
Процедура ЗапуститьЗаписьЛоговСпасибоВФоне(МассивЛогов) Экспорт
	
	Если МассивЛогов = Неопределено Или МассивЛогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(МассивЛогов);
	
	ФоновыеЗадания.Выполнить(
		"эвСберСпасибоСервер.ЗаписатьЛогиСпасибоФоном",
		ПараметрыЗадания,
		,
		НСтр("ru = 'Запись логов Спасибо'"));
	
КонецПроцедуры

// Запись пакета логов в регистр сведений Эв_ЛогСпасибо (вызывается фоновым заданием).
//
Процедура ЗаписатьЛогиСпасибоФоном(МассивЛогов) Экспорт
	
	Если МассивЛогов = Неопределено Или МассивЛогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого ЭлементЛога Из МассивЛогов Цикл
			
			МенеджерЗаписи = РегистрыСведений.Эв_ЛогСпасибо.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДатаОперации = ЭлементЛога.ДатаОперации;
			МенеджерЗаписи.Идентификатор = ЭлементЛога.Идентификатор;
			МенеджерЗаписи.Тип = ?(ЭлементЛога.ЭтоОшибка,
				Перечисления.эв_ТипыСообщенийЛога.Ошибка,
				Перечисления.эв_ТипыСообщенийЛога.Сервисное);
			МенеджерЗаписи.Сообщение = ЭлементЛога.Сообщение;
			МенеджерЗаписи.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Распределяет сумму списания Спасибо по строкам ТЧ Товары как СуммаСкидкиОплатыБонусом
// (только по ассортименту Спасибо), пересчитывает Сумма и НДС.
// Сопоставление строк — по индексам отобранных строк исходной ТЧ (без ор_ИдентификаторСтроки).
//
Процедура РаспределитьСуммуСпасибоПоТоварам(ОбъектЧека, СуммаОперацииСпасибо) Экспорт
    
    Если СуммаОперацииСпасибо <= 0 Тогда
        Возврат;
    КонецЕсли;
    
    // Индексы строк ОбъектЧека.Товары, участвующих в ассортименте Спасибо.
    ИндексыСтрокСпасибо = Новый Массив;
    СуммаТоваровСпасибо = 0;
    
    ИндексСтроки = 0;
    Для Каждого Стр Из ОбъектЧека.Товары Цикл
        
        Если Не Стр.Номенклатура.эвНеВходитВАссортиментСберСпасибо Тогда
            
            ИндексыСтрокСпасибо.Добавить(ИндексСтроки);
            СуммаТоваровСпасибо = СуммаТоваровСпасибо
                + Стр.Цена * Стр.Количество
                - Стр.СуммаАвтоматическойСкидки
                - Стр.СуммаСкидкиНаценки;
            
        КонецЕсли;
        
        ИндексСтроки = ИндексСтроки + 1;
        
    КонецЦикла;
    
    СтрокСпасибо = ИндексыСтрокСпасибо.Количество();
    Если СтрокСпасибо = 0 Или СуммаТоваровСпасибо <= 0 Тогда
        Возврат;
    КонецЕсли;
    
    СуммаОперацииСпасибоОстаток = СуммаОперацииСпасибо;
    
    Для НомерПоПорядку = 0 По СтрокСпасибо - 1 Цикл
        
        Если СуммаОперацииСпасибоОстаток <= 0 Тогда
            Прервать;
        КонецЕсли;
        
        Стр = ОбъектЧека.Товары[ИндексыСтрокСпасибо[НомерПоПорядку]];
        
        Если НомерПоПорядку = СтрокСпасибо - 1 Тогда
            СуммаСкидкиОплатыБонусом = СуммаОперацииСпасибоОстаток;
        Иначе
            БазаСтроки = Стр.Цена * Стр.Количество
                - Стр.СуммаАвтоматическойСкидки
                - Стр.СуммаСкидкиНаценки;
            КоэфСписания = БазаСтроки / СуммаТоваровСпасибо;
            СуммаСкидкиОплатыБонусом = Окр(СуммаОперацииСпасибо * КоэфСписания, 2);
        КонецЕсли;
        
        Стр.СуммаСкидкиОплатыБонусом = СуммаСкидкиОплатыБонусом;
        Стр.Сумма = Стр.Цена * Стр.Количество
            - Стр.СуммаСкидкиОплатыБонусом
            - Стр.СуммаАвтоматическойСкидки
            - Стр.СуммаСкидкиНаценки;
        
     	// Как в ФормаРМК при распределении оплаты бонусами.
        ОбщегоНазначенияРМККлиентСервер.РассчитатьСуммуНДС(ОбъектЧека, Стр);
        
        СуммаОперацииСпасибоОстаток = СуммаОперацииСпасибоОстаток - СуммаСкидкиОплатыБонусом;
        
    КонецЦикла;
    
    //ОбщегоНазначенияРМККлиентСервер.СуммаДокумента(ОбъектЧека);
    
КонецПроцедуры

Функция ДанныеОплатыЧекаПродажиДляСпасибо(ЧекККМПродажа) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторПлатежнойСистемы", "");
	Результат.Вставить("СуммаБонусовВозврата", 0);
	
	Если Не ЗначениеЗаполнено(ЧекККМПродажа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	//|	Оплата.ВидОплаты КАК ВидОплаты,
	|	Оплата.ИдентификаторПлатежнойСистемы КАК ИдентификаторПлатежнойСистемы
	//|	Оплата.СуммаБонусов КАК СуммаБонусов,
	//|	Оплата.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЧекККМ.БезналичнаяОплата КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка = &ЧекККМПродажа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оплата.НомерСтроки";
	Запрос.УстановитьПараметр("ЧекККМПродажа", ЧекККМПродажа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Результат.ИдентификаторПлатежнойСистемы)
			И ЗначениеЗаполнено(Выборка.ИдентификаторПлатежнойСистемы) Тогда
			Результат.ИдентификаторПлатежнойСистемы = Выборка.ИдентификаторПлатежнойСистемы;
		КонецЕсли;
		
		//Если Выборка.ВидОплаты = Перечисления.ВидыБезналичныхОплат.Бонусы Тогда
		//	Результат.СуммаБонусовВозврата = ?(Выборка.СуммаБонусов > 0, Выборка.СуммаБонусов, Выборка.Сумма);
		//КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
